# Pandas

- Pandas adalah tools analisis dan manipulasi data open source yang cepat, powerful, fleksibel, dan mudah digunakan dengan bahasa pemrograman Python.

- Pandas -> analisis data -> format data : .csv, .tsv, atau .xlsx -> Series dan Dataframe.

- Pandas == Queri SQL == Excel.

# Installing Pandas

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\wahyu\anaconda3\lib\site-packages (0.25.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\wahyu\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: numpy>=1.13.3 in c:\users\wahyu\anaconda3\lib\site-packages (from pandas) (1.16.5)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\wahyu\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: six>=1.5 in c:\users\wahyu\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)
Note: you may need to restart the kernel to use updated packages.

# Using Pandas

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/nbaallelo.csv')

In [4]:
# melihat jumlah baris
len(df)

126314

In [5]:
# melihat dimensi (hasil -> tuple -> baris dan kolom)
df.shape

(126314, 23)

In [6]:
# melihat data dengan lima baris pertama
df.head()       # default 5 data

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

In [7]:
df.head(9)     # dengan parameter

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN
5,3,194611020DTF,NBA,1,1947,11/2/1946,1,0,WSC,Capitols,...,43.135952,DTF,Falcons,33,1300.0000,1279.6189,A,W,0.359935,NaN
6,4,194611020PRO,NBA,1,1947,11/2/1946,1,0,BOS,Celtics,...,40.459381,PRO,Steamrollers,59,1300.0000,1305.1542,A,L,0.359935,NaN
7,4,194611020PRO,NBA,0,1947,11/2/1946,1,0,PRO,Steamrollers,...,41.540619,BOS,Celtics,53,1300.0000,1294.8458,H,W,0.640065,NaN
8,5,194611020STB,NBA,1,1947,11/2/1946,1,0,PIT,Ironmen,...,40.507980,STB,Bombers,56,1300.0000,1304.6908,A,L,0.359935,NaN

In [8]:
# melihat data dengan lima baris terakhir
df.tail()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,...,60.309792,GSW,Warriors,103,1790.9591,1809.9791,H,L,0.546572,NaN
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,...,68.013329,CLE,Cavaliers,91,1704.3949,1700.7391,H,W,0.765565,NaN
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,...,60.010067,GSW,Warriors,104,1809.9791,1813.6349,A,L,0.234435,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,...,59.290245,GSW,Warriors,105,1813.6349,1822.2881,H,L,0.481450,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,...,68.519516,CLE,Cavaliers,97,1700.7391,1692.0859,A,W,0.518550,NaN

In [9]:
# melihat tipe data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
gameorder        126314 non-null int64
game_id          126314 non-null object
lg_id            126314 non-null object
_iscopy          126314 non-null int64
year_id          126314 non-null int64
date_game        126314 non-null object
seasongame       126314 non-null int64
is_playoffs      126314 non-null int64
team_id          126314 non-null object
fran_id          126314 non-null object
pts              126314 non-null int64
elo_i            126314 non-null float64
elo_n            126314 non-null float64
win_equiv        126314 non-null float64
opp_id           126314 non-null object
opp_fran         126314 non-null object
opp_pts          126314 non-null int64
opp_elo_i        126314 non-null float64
opp_elo_n        126314 non-null float64
game_location    126314 non-null object
game_result      126314 non-null object
forecast         126314 non-null float64
notes            5424 non-null object
dtypes: float64(6), int64(7), object(10)
memory usage: 22.2+ MB

In [10]:
# Basics Statistics
df.describe()

,gameorder,_iscopy,year_id,seasongame,is_playoffs,pts,elo_i,elo_n,win_equiv,opp_pts,opp_elo_i,opp_elo_n,forecast
count,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000
mean,31579.000000,0.500000,1988.200374,43.533733,0.063857,102.729982,1495.236055,1495.236055,41.707889,102.729982,1495.236055,1495.236055,0.500000
std,18231.927643,0.500002,17.582309,25.375178,0.244499,14.814845,112.139945,112.461687,10.627332,14.814845,112.139945,112.461687,0.215252
min,1.000000,0.000000,1947.000000,1.000000,0.000000,0.000000,1091.644500,1085.774400,10.152501,0.000000,1091.644500,1085.774400,0.020447
25%,15790.000000,0.000000,1975.000000,22.000000,0.000000,93.000000,1417.237975,1416.994900,34.103035,93.000000,1417.237975,1416.994900,0.327989
50%,31579.000000,0.500000,1990.000000,43.000000,0.000000,103.000000,1500.945550,1500.954400,42.113357,103.000000,1500.945550,1500.954400,0.500000
75%,47368.000000,1.000000,2003.000000,65.000000,0.000000,112.000000,1576.060000,1576.291625,49.635328,112.000000,1576.060000,1576.291625,0.672011
max,63157.000000,1.000000,2015.000000,108.000000,1.000000,186.000000,1853.104500,1853.104500,71.112038,186.000000,1853.104500,1853.104500,0.979553

In [11]:
# mengambil 1 kolom 
df['pts'].describe()

count    126314.000000
mean        102.729982
std          14.814845
min           0.000000
25%          93.000000
50%         103.000000
75%         112.000000
max         186.000000
Name: pts, dtype: float64

In [12]:
# mengambil 2 kolom
df[['pts', 'elo_i']].describe()

                 pts          elo_i
count  126314.000000  126314.000000
mean      102.729982    1495.236055
std        14.814845     112.139945
min         0.000000    1091.644500
25%        93.000000    1417.237975
50%       103.000000    1500.945550
75%       112.000000    1576.060000
max       186.000000    1853.104500

# EDA (Exploratory Data Analysis)

- membantu untuk menjawab pertanyaan tentang kumpulan data
contoh : memeriksa seberapa sering nilai tertentu muncul dalam kolom

In [13]:
df['team_id']

0         TRH
1         NYK
2         CHS
3         NYK
4         DTF
         ...
126309    CLE
126310    GSW
126311    CLE
126312    CLE
126313    GSW
Name: team_id, Length: 126314, dtype: object

In [14]:
# memeriksa seberapa sering nilai tertentu muncul dalam kolom
df['team_id'].value_counts()

BOS    5997
NYK    5769
LAL    5078
DET    4985
PHI    4533
       ...
DTF      60
INJ      60
TRH      60
PIT      60
SDS      11
Name: team_id, Length: 104, dtype: int64

In [15]:
df['fran_id']

0           Huskies
1            Knicks
2             Stags
3            Knicks
4           Falcons
            ...
126309    Cavaliers
126310     Warriors
126311    Cavaliers
126312    Cavaliers
126313     Warriors
Name: fran_id, Length: 126314, dtype: object

In [16]:
fran_lakers = df['fran_id'] == 'Lakers'
df[fran_lakers]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
1136,569,194811040BLB,NBA,1,1949,11/4/1948,1,0,MNL,Lakers,...,51.218754,BLB,Baltimore,72,1507.2052,1491.9507,A,W,0.386583,NaN
1152,577,194811060WSC,NBA,1,1949,11/6/1948,2,0,MNL,Lakers,...,50.621624,WSC,Capitols,67,1481.8721,1487.9188,A,L,0.443232,NaN
1159,580,194811090BOS,NBA,1,1949,11/9/1948,3,0,MNL,Lakers,...,48.341133,BOS,Celtics,77,1359.3345,1382.0542,A,L,0.608859,NaN
1170,586,194811110NYK,NBA,1,1949,11/11/1948,4,0,MNL,Lakers,...,49.499451,NYK,Knicks,68,1460.4232,1448.9517,A,W,0.432863,NaN
1183,592,194811130PRO,NBA,1,1949,11/13/1948,5,0,MNL,Lakers,...,50.330185,PRO,Steamrollers,67,1245.9456,1237.6326,A,W,0.737010,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
126016,63009,201504080DEN,NBA,1,2015,4/8/2015,78,0,LAL,Lakers,...,21.921890,DEN,Nuggets,119,1415.0565,1421.3248,A,L,0.238914,NaN
126052,63027,201504100LAL,NBA,0,2015,4/10/2015,79,0,LAL,Lakers,...,22.371969,MIN,Timberwolves,98,1283.9249,1278.4835,H,W,0.670716,NaN
126086,63044,201504120LAL,NBA,0,2015,4/12/2015,80,0,LAL,Lakers,...,21.791288,DAL,Mavericks,120,1556.2162,1563.2498,H,L,0.304769,NaN
126115,63058,201504130SAC,NBA,1,2015,4/13/2015,81,0,LAL,Lakers,...,21.422607,SAC,Kings,102,1395.6000,1400.1278,A,L,0.251263,NaN
126137,63069,201504150LAL,NBA,0,2015,4/15/2015,82,0,LAL,Lakers,...,19.985550,SAC,Kings,122,1400.1278,1418.2802,H,L,0.501819,NaN

In [17]:
df[fran_lakers]['team_id'].value_counts()

LAL    5078
MNL     946
Name: team_id, dtype: int64

In [18]:
fran_nuggets = df['fran_id'] == 'Nuggets'
df[fran_nuggets]['team_id']
df[fran_nuggets]['team_id'].value_counts()

DEN    3312
DNR     614
DNA     194
Name: team_id, dtype: int64

In [19]:
mnl_team = df['team_id'] == 'MNL'
# df[mnl_team]
# df[mnl_team]['date_game']
# df[mnl_team]['date_game'].min()
df[mnl_team]['date_game'].max()
df[mnl_team]['date_game'].agg(['min', 'max'])

min    1/1/1949
max    4/9/1959
Name: date_game, dtype: object

In [20]:
df[mnl_team]['pts'].agg(['min', 'max'])

min     18
max    139
Name: pts, dtype: int64

In [22]:
mnl_team = df['team_id'] == 'MNL'
# df[mnl_team]
# df[mnl_team]['date_game']
df[mnl_team]['date_game'].min()

'1/1/1949'

In [23]:
df[mnl_team]['date_game'].max()

'4/9/1959'

In [25]:
bos_team = df['team_id'] == 'BOS'
df[bos_team]['pts'].sum()

626484

In [26]:
#implicit index
revenues = pd.Series([5555, 7000, 1980])
revenues

0    5555
1    7000
2    1980
dtype: int64

In [27]:
revenues.values

array([5555, 7000, 1980], dtype=int64)

In [28]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

In [29]:
# initiating/creating Series with explicit index #1
city_revenues = pd.Series(
    [4200, 8000, 6500],
    index=["Amsterdam", "Toronto", "Tokyo"]
)
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [30]:
#positional index
city_revenues[0]

4200

In [32]:
#label index
city_revenues['Amsterdam']

4200

In [33]:
# city_revenues.value
city_revenues.keys()

Index(['Amsterdam', 'Toronto', 'Tokyo'], dtype='object')

In [34]:
# initiating/creating Series with explicit index #2
city_employee_count = pd.Series({"Amsterdam": 5, "Tokyo": 8})
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [35]:
city_employee_count.keys()

Index(['Amsterdam', 'Tokyo'], dtype='object')

In [36]:
"New York" in city_employee_count

False

In [37]:
"Tokyo" in city_employee_count

True

In [38]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [39]:
city_data = pd.DataFrame(
    {
        "revenue" : city_revenues,
        "employee_count" : city_employee_count
    }
)

In [40]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

"NaN --> np.nan " NaN values adalah object nan ‘milik’ NumPy*) …by saying milik NumPy i mean  = bawaan = built-in object

In [42]:
city_data.index

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [43]:
city_data.axes[0] #rows

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [44]:
city_data.axes[1] # columns

Index(['revenue', 'employee_count'], dtype='object')

In [50]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index=[1, 2, 3, 5, 8]
)
colors

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object

In [51]:
colors.loc[1] #loc untuk manggil explicit indexnyaa

'red'

In [52]:
colors.iloc[0] #iloc untuk manggil implicit indexnya

'red'

- Slicing list python : start inclusive, stopnya exclusive
- Slicing loc : start inclusive, stopnya inclusive
- Slicing iloc: start inclusive, stopnya exclusive

In [53]:
colors.iloc[1:3]
# 1st, 2nd element only

2    purple
3      blue
dtype: object

In [56]:
colors.loc[2:5]

2    purple
3      blue
5     green
dtype: object

In [57]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [55]:
# city_data['revenue']
city_data.revenue

Amsterdam    4200
Tokyo        6500
Toronto      8000
Name: revenue, dtype: int64

In [58]:
# city_data['employee_count']
city_data.employee_count

Amsterdam    5.0
Tokyo        8.0
Toronto      NaN
Name: employee_count, dtype: float64

In [59]:
toys = pd.DataFrame([
    {"name": "ball", "shape":"sphere"},
    {"name": "Rubik's cube", "shape": "cube"}
])
toys

           name   shape
0          ball  sphere
1  Rubik's cube    cube

In [60]:
toys["shape"]

0    sphere
1      cube
Name: shape, dtype: object

In [61]:
toys.shape

(2, 2)

In [62]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [63]:
# city_data.loc["Tokyo": "Toronto"]
city_data.loc["Amsterdam": "Tokyo"]

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0

In [64]:
# df.iloc[-2]
df.iloc[-2010]

gameorder               62153
game_id          201412080WAS
lg_id                     NBA
_iscopy                     0
year_id                  2015
date_game           12/8/2014
seasongame                 20
is_playoffs                 0
team_id                   WAS
fran_id               Wizards
pts                       133
elo_i                 1560.87
elo_n                  1562.1
win_equiv             46.9943
opp_id                    BOS
opp_fran              Celtics
opp_pts                   132
opp_elo_i             1401.85
opp_elo_n             1400.62
game_location               H
game_result                 W
forecast             0.816229
notes                     NaN
Name: 124304, dtype: object

In [66]:
df.loc[124304]
# df.iloc[-2010]

gameorder               62153
game_id          201412080WAS
lg_id                     NBA
_iscopy                     0
year_id                  2015
date_game           12/8/2014
seasongame                 20
is_playoffs                 0
team_id                   WAS
fran_id               Wizards
pts                       133
elo_i                 1560.87
elo_n                  1562.1
win_equiv             46.9943
opp_id                    BOS
opp_fran              Celtics
opp_pts                   132
opp_elo_i             1401.85
opp_elo_n             1400.62
game_location               H
game_result                 W
forecast             0.816229
notes                     NaN
Name: 124304, dtype: object